[
  {
    "id": "compreg",
    "time": 2021,
    "title": "Compound Registation",
    "description": "Compound Registration compares the uniqueness of new small molecules against those already stored in your database. It then kickstarts a decision workflow based on your configured business logic.",
    "type": "Web",
    "technologies": ["React", "Jest", "Playwright", "D3", "Spring", "AngularJS"]
  },
  {
    "id": "skoda-connect",
    "time": 2018,
    "title": "ŠKODA Connect",
    "description": "Automated remote vehicle management. The users can comfortably check their vehicle status, health or even plan trips ahead.",
    "type": "Web",
    "technologies": ["React", "Node.js", "Spring Cloud", "Gradle"]
  },
  {
    "id": "trustee",
    "time": 2018,
    "title": "Trustee",
    "description": "The Trustee framework is flexible solution to pseudonymize information during data ingest. It primarily focuses on being an encryption coordinator between participants in a Big Data environment.",
    "type": "Big data",
    "technologies": ["Hadoop", "Spark", "Flume", "Hive"]
  },
  {
    "id": "dataservice",
    "time": 2017,
    "title": "DataService",
    "description": "DataService is a JAVAEE application which provides a very intuitive solution to build and manage extra-large databases. One of the main advantage of this application is the ability to automatically generate SQL queries by non-developers.",
    "type": "Web",
    "technologies": ["Primefaces", "Websphere"]
  },
  {
    "id": "cardo",
    "time": 2017,
    "title": "CARDO",
    "description": "The program itself calculates and transfers emission data for every car according to the new Government regulations. In this project, I've designed the Hub and wrote the specification before the development. That document covered covered all parts of the application along with the communication with external services.",
    "type": "Microservice",
    "technologies": ["Glassfish", "EJB", "JMS", "JPA"]
  },
  {
    "id": "ipl",
    "time": 2017,
    "title": "IPL",
    "description": "This project aimed to create a new and more advanced web application to the dealers to manage and sell cars.",
    "type": "Web",
    "technologies": ["Play", "React", "Swagger", "EJB"]
  },
  {
    "id": "bdotom",
    "time": 2016,
    "title": "BDOTOM",
    "description": "BDOTOM is an application to manage employee time-offs, holidays and resources for any company. Employees can submit and review their holidays. And on the other hand, managers can organize their team and resources. The application also provides an easy way to manage holidays for HR assistants.",
    "type": "Web",
    "technologies": ["EJB", "JBoss", "AngularJS", "JAXRS"]
  },
  {
    "id": "forumstar",
    "time": 2016,
    "title": "ForumStar",
    "description": "ForumStar is a text editor desktop application. Unlike the most popular text editors, ForumStar also supports supports developer mode. In this mode advanced users are able to create complex forms with most popular programming tools like: For, If, While, Connection, etc.",
    "type": "Desktop",
    "technologies": ["JavaFX", "FXML", "CSS"]
  },
  {
    "id": "bip",
    "time": 2016,
    "title": "BIP",
    "description": "The application is a unique tool to create, maintain and execute SQL commands towards a database. The program is primarily developed for Second-level Support.",
    "type": "Web",
    "technologies": ["Glassfish", "EJB", "OracleDB"]
  },
  {
    "id": "starmonitor",
    "time": 2016,
    "title": "StarMonitor",
    "description": "StarMonitor is a very complex project & workflow management application. A single presentation wraps all the inquiries and supplier offers which results a nomination. Users of the application are able to browse and control the flow to get the best result and profit.",
    "type": "Web",
    "technologies": ["Spring", "ActiveMQ", "JSF", "JPA"]
  },
  {
    "id": "psc",
    "time": 2015,
    "title": "PSC",
    "description": "The PSC web application is a web application for project managers. Using this tool, the users are able to\n          maintain several vehicle manufacturing projects and their assets.",
    "type": "Web",
    "technologies": ["Spring", "Liquibase", "JPA"]
  },
  {
    "id": "alarmannen",
    "time": 2014,
    "title": "Alarmmannen",
    "description": "The platform supports several security manufacturers and their home security solutions. The application listens for security events. The server is not only capable to remotely control the secured premises but able to recognize and start a process which alerts the end-users or guarding companies.",
    "type": "Web",
    "technologies": ["JavaEE", "JBoss", "Seam", "JSF", "Magento"]
  },
  {
    "id": "dkh",
    "time": 2013,
    "title": "DKH",
    "description": "The purpose of this project is to make the doctors’ life easier with an easy-to-use web application. Besides patient and document management, the doctors are able to assemble medical forms to collect patient data.",
    "type": "Web",
    "technologies": ["JavaEE", "JBoss", "Seam", "JSF", "Hibernate"]
  },
  {
    "id": "gremon",
    "time": 2012,
    "title": "Gremon",
    "description": "Greenhouse management system. The software monitors and manages several greenhouses and their crops. It also helps to effectively manage the employees.",
    "type": "Web",
    "technologies": ["JavaEE", "JBoss", "Seam", "JSF", "Hibernate"]
  },
  {
    "id": "proseniis",
    "time": 2009,
    "title": "Proseniis",
    "description": "E-health application. The purpose of the application was to collect and monitor healthcare data. The application also gave a unified web interface for both the patients and the doctors. The application also gave the opportunity to the healthcare employees to set up automatized workflows.",
    "type": "Web",
    "technologies": ["JavaEE", "JBoss", "Seam", "JSF", "Hibernate"]
  }
]

